<a href="https://colab.research.google.com/github/jagilisreeja/NLP-Exp_4/blob/main/NLP_EXPT4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [5]:
# Text Cleaning Processing: Removing emails, URLs, Numbers and other unwanted elements in order to prepare clean structured text for effective NLP tasks.

In [6]:
import pandas as pd
import numpy as np
import re

In [11]:
data_out = pd.read_csv('/content/twitter4000.csv')

In [8]:
#For removing emails
pattern = r'\w+@\w+.\w+'

In [9]:
pattern = r'\b[A-za-z._+-]+@[A-za-z.].[A-z|a-z]{2,}\b'

In [12]:
data_out['twitts'].apply(lambda x: re.findall(pattern=pattern, string=x))

0       []
1       []
2       []
3       []
4       []
        ..
3995    []
3996    []
3997    []
3998    []
3999    []
Name: twitts, Length: 4000, dtype: object

In [13]:
#For removing URLs
pattern = r'http\S+|www\S+'
data_out['twitts'].apply(lambda x: re.findall(pattern=pattern, string=x))

0           []
1           []
2       [wwww]
3           []
4           []
         ...
3995        []
3996        []
3997        []
3998        []
3999        []
Name: twitts, Length: 4000, dtype: object

In [14]:
#For removing Numbers
pattern = r'\w+[0-9]\w+'
data_out['twitts'].apply(lambda x: re.findall(pattern=pattern, string=x))

0           []
1           []
2           []
3           []
4           []
         ...
3995        []
3996        []
3997        []
3998        []
3999    [18th]
Name: twitts, Length: 4000, dtype: object